assignment05.tex
% Created 2019-01-17 Thu 11:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Nathan Hitchings}
\date{\today}
\title{Assignment 5 Solutions}
\hypersetup{
 pdfauthor={Nathan Hitchings},
 pdftitle={Assignment 5 Solutions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2)},
 pdflang={English}}
\begin{document}

\maketitle
\section{Exercise 1.20}
\label{sec:org9d22b50}
The process that a procedure generates is of course dependent on the rules
used by the interpreter. As an example, consider the iterative \texttt{gcd} procedure
given above. Suppose we were to interpret this procedure using normal-order
evaluation, as discussed in Section 1.1.5. (The normal-order-evaluation rule
for \texttt{if} is described in Exercise 1.5.) Using the substitution method (for
normal order), illustrate the process generated in evaluating \texttt{(gcd 206 40)}
and indicate the \texttt{remainder} operations that are actually performed. How many
\texttt{remainder} operations are actually performed in the normal-order evaluation
of \texttt{(gcd 206 40)}? In the applicative-order evaluation?
\subsection{Solution}
\label{sec:orgabd35fe}
This is the \texttt{gcd} procedure:
\begin{verbatim}
(define (gcd a b)
  (if (= b 0)
      a
      (gcd b (remainder a b))))
\end{verbatim}
Evaluating \texttt{(gcd 206 40)} using normal order we get
\begin{verbatim}
;; Normal order
(gcd 206 40)

(if (= 40 0)
    206
    (gcd 40 (remainder 206 40)))

;; expand gcd
(if (= (remainder 206 40) 0)
    40
    (gcd (remainder 206 40) (remainder 40 (remainder 206 40))))
(if (= 6 0) ; 1
    40
    (gcd (remainder 206 40) (remainder 40 (remainder 206 40))))

;; expand gcd
(if (= (remainder 40 (remainder 206 40)) 0)
    (remainder 206 40)
    (gcd (remainder 40 (remainder 206 40))
         (remainder (remainder 206 40)
                    (remainder 40 (remainder 206 40)))))
(if (= (remainder 40 6) 0) ; 2
    (remainder 206 40)
    (gcd (remainder 40 (remainder 206 40))
         (remainder (remainder 206 40)
                    (remainder 40 (remainder 206 40)))))
(if (= 4 0) ; 3
    (remainder 206 40)
    (gcd (remainder 40 (remainder 206 40))
         (remainder (remainder 206 40)
                    (remainder 40 (remainder 206 40)))))
;; expand gcd
(if (= (remainder (remainder 206 40) (remainder 40 (remainder 206 40))) 0)
    (remainder 40 (remainder 206 40))
    (gcd (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))
         (remainder (remainder 40 (remainder 206 40))
                    (remainder (remainder 206 40)
                               (remainder 40 (remainder 206 40))))))
(if (= (remainder 6 (remainder 40 6)) 0) ; 4 and 5
    (remainder 40 (remainder 206 40))
    (gcd (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))
         (remainder (remainder 40 (remainder 206 40))
                    (remainder (remainder 206 40)
                               (remainder 40 (remainder 206 40))))))


;; Applicative order
(gcd 206 40)
(gcd 40 (remainder 206 40))
(gcd 40 6)
(gcd 6 (remainder 40 6))
(gcd 6 4)
(gcd 4 (remainder 6 4))
(gcd 4 2)
(gcd 2 (remainder 4 2))
(gcd 2 0)
2
\end{verbatim}
So, \texttt{remainder} is evaluated 4 times using applicative order and a lot more
times (18) using normal order.
\end{document}